:PROPERTIES:
:ID:       c2166bc0-a37f-432e-ad1d-9e9fda2e3b99
:header-args:C++: :noweb yes :results output
:END:
#+title: gl
#+filetags: :core:
#+date: [2024-05-17 五]
#+last_modified: [2024-07-06 六 02:24]



|------------------+--------------------------------------------------------------------|
| ModelMatrix      | The Transform Object do ti trave on The World                      |
|------------------+--------------------------------------------------------------------|
| ViewMatrix       | Move "Camera" to adjust viewpoint to see Object,                   |
|                  | In OpenGl Camera in origin, and see to nagative z axes.            |
|                  | we move object to adjust viewpoint, becouse we cannot move carmera |
|------------------+--------------------------------------------------------------------|
| projectionMatrix | poject the object into near plane(that is where screen is in)      |
|------------------+--------------------------------------------------------------------|

* 查找依赖

#+begin_src sh
  pkg-config --print-requires --print-requires-private glfw3
#+end_src

#+RESULTS:
| x11     |
| xrandr  |
| xi      |
| xxf86vm |
| gl      |



#+begin_src sh
  pkg-config --print-requires --print-requires-private glew
#+end_src

#+RESULTS:
: glu



** 顶点着色器

#+NAME: point_v
#+BEGIN_SRC ruby
   "#version 450 
    void main(void)
    {
       gl_Position = vec4(0.0,0.0,0.0,1.0);
    }".gsub("\n", "\\\n\\n")
#+END_SRC

#+RESULTS: point_v
: #version 450 \
: \n void main(void)\
: \n {\
: \n    gl_Position = vec4(0.0,0.0,0.0,1.0);\
: \n }


** 片元着色器

#+NAME: point_f
#+BEGIN_SRC ruby
  "#version 450
   out vec4 color;
   void main(void)
   {
      color = vec4(0.0,0.0,1.0,1.0);
   }
  ".gsub("\n", "\\\n\\n")
#+END_SRC

#+RESULTS: point_f
: #version 450\
: \n out vec4 color;\
: \n void main(void)\
: \n {\
: \n    color = vec4(0.0,0.0,1.0,1.0);\
: \n }\
: \n


** 顶点着色器 三角形 
#+NAME: triangle_v
#+BEGIN_SRC ruby 
  "#version 450 core 
  layout(location=0) in vec3 position;
  void main(void)
  {
     const vec4 vertices[3] = vec4[3](vec4(0.25, -0.25, 0.5, 1.0),
				      vec4(-0.25, -0.25, 0.5, 1.0),
				      vec4(0.25, 0.25, 0.5, 1.0));

     gl_Position = vertices[gl_VertexID];
  }".gsub("\n", "\\\n\\n")
#+END_SRC

#+RESULTS: triangle_v
#+begin_example
#version 450 core \
\nlayout(location=0) in vec3 position;\
\nvoid main(void)\
\n{\
\n   const vec4 vertices[3] = vec4[3](vec4(0.25, -0.25, 0.5, 1.0),\
\n				    vec4(-0.25, -0.25, 0.5, 1.0),\
\n				    vec4(0.25, 0.25, 0.5, 1.0));\
\n\
\n   gl_Position = vertices[gl_VertexID];\
\n}
#+end_example


